/**
 * Вариант отображения текста 
 */
export enum TTypographyVariant 
{
  /**
   * Заголовок 3 уровня
   */
  Heading3 = 'h3',

  /**
   * Заголовок 4 уровня
   */
  Heading4 = 'h4',

  /**
   * Заголовок 5 уровня
   */
  Heading5 = 'h5',

  /**
   * Заголовок 6 уровня
   */
  Heading6 = 'h6',

  /**
   * Подзаголовок 1 уровня
   */
  Subtitle1 = 'subtitle1',

  /**
   * Подзаголовок 2 уровня
   */
  Subtitle2 = 'subtitle2',

  /**
   * Основной текст вариант 1
   */
  Body1 = 'body1',

  /**
   * Основной текст вариант 2
   */
  Body2 = 'body2',

  /**
   * Надпись вариант 1
   */
  Caption1 = 'caption1',
}
