//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Константы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserRoleConstants.cs
*		Константы для ролей пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserConstants
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Константы для ролей пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XRoleConstants
		{
			/// <summary>
			/// Роль администратора
			/// </summary>
			public static readonly CRole Admin = new CRole()
			{
				Id = 1,
				DispalyName = "Администратор",
				SystemName = "admin",
			};

			/// <summary>
			/// Роль редактора/модератора
			/// </summary>
			public static readonly CRole Editor = new CRole()
			{
				Id = 2,
				DispalyName = "Редактор",
				SystemName = "editor",
            };

			/// <summary>
			/// Роль пользователя
			/// </summary>
			public static readonly CRole User = new CRole()
			{
				Id = 3,
				DispalyName = "Пользователь",
				SystemName = "user",
            };
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================