//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Константы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserClaimsConstants.cs
*		Константы для формирования данных в токене.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup AuthUserConstants Константы
         * \ingroup AuthUser
         * \brief Константы модуля.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Константы утверждений для формирования данных в токене
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XClaimsConstants
		{
			/// <summary>
			/// Идентификатор пользователя
			/// </summary>
			public const String UserId = "sub";

			/// <summary>
			/// Логин пользователя
			/// </summary>
			public const String UserLogin = "name";

			/// <summary>
			/// Роль пользователя
			/// </summary>
			public const String UserRole = "role";

			/// <summary>
			/// Имя пользователя
			/// </summary>
			public const String UserName = "user_name";

			/// <summary>
			/// Фамилия пользователя
			/// </summary>
			public const String UserSurname = "user_surname";

			/// <summary>
			/// Отчество пользователя
			/// </summary>
			public const String UserFathersname = "user_fathersname";

			/// <summary>
			/// Должность пользователя
			/// </summary>
			public const String UserPosition = "user_position";

			/// <summary>
			/// Группа пользователя
			/// </summary>
			public const String UserGroup = "user_group";

			/// <summary>
			/// Разрешения пользователя
			/// </summary>
			public const String UserPermissions = "user_permissions";

			/// <summary>
			/// Идентификатор сессии пользователя
			/// </summary>
			public const String UserSessionId = "user_session_id";
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================