//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Константы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserPermissionConstants.cs
*		Базовые константы для разрешений пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserConstants
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Базовые константы для разрешений пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XPermissionConstants
		{
			/// <summary>
			/// Базовое разрешение для полного доступа в систему
			/// </summary>
			public static readonly CPermission Admin = new CPermission()
			{
				Id = 1,
				DispalyName = "Администрирование системы",
				SystemName = "admin",
			};

            /// <summary>
            /// Базовое разрешение для модератора/редактора
            /// </summary>
            public static readonly CPermission Editor = new CPermission()
            {
                Id = 2,
                DispalyName = "Модератор",
                SystemName = "editor",
            };

            /// <summary>
            /// Базовое разрешение для пользователя
            /// </summary>
            public static readonly CPermission User = new CPermission()
            {
                Id = 3,
                DispalyName = "Пользователь",
                SystemName = "user",
            };
        }
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================