//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Константы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserPositionConstants.cs
*		Константы для должностей пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserConstants
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Константы для должностей пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XPositionConstants
		{
			/// <summary>
			/// Инспектор
			/// </summary>
			public static readonly CPosition Inspector = new CPosition()
			{
				Id = 1,
				Name = "Инспектор",
				ShortName = "Инспектор",
			};

			/// <summary>
			/// Старший инспектор
			/// </summary>
			public static readonly CPosition ChiefInspector = new CPosition()
			{
				Id = 2,
				Name = "Старший инспектор",
				ShortName = "Старший инспектор",
			};

			/// <summary>
			/// Ведущий специалист
			/// </summary>
			public static readonly CPosition LeadingSpecialist = new CPosition()
			{
				Id = 3,
				Name = "Ведущий специалист",
				ShortName = "Ведущий специалист",
			};

			/// <summary>
			/// Начальник отдела
			/// </summary>
			public static readonly CPosition DepartmentHead = new CPosition()
			{
				Id = 4,
				Name = "Начальник отдела",
				ShortName = "Начальник отдела",
			};
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================