//=====================================================================================================================
// Проект: Общий модуль платформы Web
// Раздел: Подсистема устройства входа
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusWebDevice.cs
*		Класс для определения устройство входа пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System.ComponentModel.DataAnnotations;
using Microsoft.EntityFrameworkCore;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace Web
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup WebCommonDevice Подсистема устройства входа
         * \ingroup WebCommon
         * \brief Подсистема устройства входа.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для определения устройство входа пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class Device : EntityDb<Int32>
        {
            #region ======================================= КОНСТАНТНЫЕ ДАННЫЕ ========================================
            /// <summary>
            /// Неизвестный параметр устройства
            /// </summary>
            public const string Unknow = "Unknow";

            /// <summary>
            /// Имя таблицы
            /// </summary>
            public const String TABLE_NAME = "Device";
			#endregion

			#region ======================================= МЕТОДЫ ОПРЕДЕЛЕНИЯ МОДЕЛЕЙ ================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конфигурирование модели для типа <see cref="Device"/>
			/// </summary>
			/// <param name="modelBuilder">Интерфейс для построения моделей</param>
			/// <param name="schemeName">Схема куда будет помещена таблица</param>
			//---------------------------------------------------------------------------------------------------------
			public static void ModelCreating(ModelBuilder modelBuilder, String schemeName)
            {
                // Определение для таблицы
                var model = modelBuilder.Entity<Device>();
                model.ToTable(TABLE_NAME, schemeName);
            }
            #endregion

            #region ======================================= СВОЙСТВА ==================================================
            /// <summary>
            /// Тип устройства
            /// </summary>
            [MaxLength(40)]
            public String? Family { get; set; }

            /// <summary>
            /// Бренд устройства
            /// </summary>
            [MaxLength(20)]
            public String? Brand { get; set; }

            /// <summary>
            /// Модель устройства
            /// </summary>
            [MaxLength(20)]
            public String? Model { get; set; }

            /// <summary>
            /// Код устройства
            /// </summary>
            [MaxLength(60)]
            public String CodeId { get; private set; } = null!;

            /// <summary>
            /// Статус мобильного устройства
            /// </summary>
            public Boolean IsMobileDevice { get; set; }

            /// <summary>
            /// Наименование операционной системы
            /// </summary>
            public String? Platform { get; set; }
            #endregion

            #region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Установка кода устройства
            /// </summary>
            //---------------------------------------------------------------------------------------------------------
            public void SetCodeId()
            {
                CodeId = $"{Family ?? Unknow}-{Brand ?? Unknow}-{Model ?? Unknow}";
            }
            #endregion
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================