//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Подсистема авторизации
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusLoginParametersDto.cs
*		Класс определяющий минимально необходимые параметры для аутентификации.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel.DataAnnotations;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserAuthorize
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс определяющий минимально необходимые параметры для аутентификации
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CLoginParametersDto
		{
			/// <summary>
			/// Логин
			/// </summary>
			[Required]
			[Display(Name = "Логин")]
			public String Login { get; set; } = null!;

			/// <summary>
			/// Пароль
			/// </summary>
			[Required]
			[DataType(DataType.Password)]
			[Display(Name = "Пароль")]
			public String Password { get; set; } = null!;

			/// <summary>
			/// Запомнить меня
			/// </summary>
			/// <remarks>
			/// Параметры пользователя сохраняются в куках
			/// </remarks>
			[Required]
			[Display(Name = "Запомнить меня")]
			public Boolean RememberMe { get; set; }
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================