//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Подсистема авторизации
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserAuthorizeInterface.cs
*		Определение интерфейса сервиса для авторизации пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System.Security.Claims;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
using Lotus.Repository;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup AuthUserAuthorize Подсистема авторизации
         * \ingroup AuthUser
         * \brief Подсистема авторизации.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейса сервиса для авторизации пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusUserAuthorizeService
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Аутентификация пользователя
			/// </summary>
			/// <param name="loginParameters">Параметры для аутентификации пользователя</param>
			/// <param name="browser">Браузер входа</param>
			/// <param name="device">Устройство входа</param>
			/// <returns>Набор утверждений</returns>
			//---------------------------------------------------------------------------------------------------------
			Task<Response<ClaimsPrincipal>> LoginAsync(CLoginParametersDto loginParameters, String browser, CDevice? device);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Выход из статуса аутентификации пользователя
			/// </summary>
			/// <param name="accessToken">Токен доступа</param>
			/// <returns>Задача</returns>
			//---------------------------------------------------------------------------------------------------------
			Task LogoutAsync(String? accessToken);
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================