//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Подсистема авторизации
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserAuthorizeInfo.cs
*		Класс определяющий минимальную информацию об авторизации пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserAuthorize
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс определяющий минимальную информацию об авторизации пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CUserAuthorizeInfo : IUserInfo
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Статус авторизации пользователя
			/// </summary>
			public Boolean IsAuthenticated { get; set; }

			//
			// ИДЕНТИФИКАЦИЯ
			//
			/// <summary>
			/// Идентификатор пользователя
			/// </summary>
			public Guid Id { get; set; }

			/// <summary>
			/// Логин пользователя
			/// </summary>
			public String Login { get; set; } = String.Empty;

            /// <summary>
            /// Почта пользователя
            /// </summary>
            public String? Email { get; set; }

			/// <summary>
			/// Статус потверждение почты
			/// </summary>
			public Boolean EmailConfirmed { get; set; }

			//
			// ПЕРСОНАЛЬНЫЕ ДАННЫЕ
			//
			/// <summary>
			/// Имя пользователя
			/// </summary>
			public String? Name { get; set; }

			/// <summary>
			/// Фамилия пользователя
			/// </summary>
			public String? Surname { get; set; }

			/// <summary>
			/// Отчество пользователя
			/// </summary>
			public String? Patronymic { get; set; }

			/// <summary>
			/// День рождение
			/// </summary>
			public DateOnly? Birthday { get; set; }

			//
			// РОЛЬ И РАЗРЕШЕНИЯ
			//
			/// <summary>
			/// Служебное наименование роли
			/// </summary>
			public String RoleSystemName { get; set; } = String.Empty;

            /// <summary>
            /// Список системных имен разрешений в виде текста
            /// </summary>
            public String PermissionsSystemNamesAsText { get; set; } = String.Empty;

            //
            // ДОЛЖНОСТЬ
            //
            /// <summary>
            /// Краткое наименование должности
            /// </summary>
            public String PostShortName { get; set; } = String.Empty;

            //
            // ГРУППЫ
            //
            /// <summary>
            /// Список имен групп пользователя в виде текста
            /// </summary>
            public String GroupNamesAsText { get; set; } = String.Empty;
            //
            // CФЕРЫ ДЕЯТЕЛЬНОСТИ
            //
            /// <summary>
            /// Список имен сфер деятельности пользователя в виде текста
            /// </summary>
            public String FieldActivityNamesAsText { get; set; } = String.Empty;
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CUserAuthorizeInfo()
			{
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================