//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Подсистема авторизации
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserAuthorizeConst.cs
*		 Константы и текстовые данные подсистемы авторизации пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserAuthorize
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для констант и текстовых данных подсистемы авторизации пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XAuthorizeConst
		{
			#region ======================================= ДАННЫЕ ====================================================
			/// <summary>
			/// Пользователь не найден
			/// </summary>
			public static readonly Result UserNotFound = new()
			{
				Code = 1000,
				Message = "Пользователь не найден",
				Succeeded = false,
			};

			/// <summary>
			/// Настроена двухфакторная авторизация
			/// </summary>
			public static readonly Result RequiresTwoFactor = new()
			{
				Code = 1002,
				Message = "Настроена двухфакторная авторизация",
				Succeeded = false,
            };

            /// <summary>
            /// Пользователь заблокирован
            /// </summary>
            public static readonly Result UserLocked = new()
            {
                Code = 1003,
                Message = "Пользователь заблокирован",
				Succeeded = false,
            };

            /// <summary>
            /// Неверный пароль
            /// </summary>
            public static readonly Result WrongPassword = new()
            {
                Code = 1004,
                Message = "Неверный пароль",
				Succeeded = false,
            };
            #endregion
        }
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================