//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Подсистема работы с должностями
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserPositionConst.cs
*		 Константы и текстовые данные подсистемы работы с должностями.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System.Net;
using Lotus.Core;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserAuthorize
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для констант и текстовых данных подсистемы работы с должностями
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XPositionConst
		{
			#region ======================================= ДАННЫЕ ====================================================
			/// <summary>
			/// Должность не найдена
			/// </summary>
			public static readonly Result NotFound = new()
			{
				Code = 1000,
				Message = "Должность не найдена",
				Succeeded = false,
			};

			/// <summary>
			/// Нельзя удалить константную должность
			/// </summary>
			public static readonly Result NotDeleteConst = new()
			{
				Code = 1002,
				Message = "Нельзя удалить константную должность",
				Succeeded = false,
            };
            #endregion
        }
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================