//=====================================================================================================================
// Проект: Web API модуля авторизации пользователя
// Раздел: Подсистема инфраструктуры
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusPermissionsExtension.cs
*		Методы расширения для авторизации на основе разрешений.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System.Security.Claims;
using Microsoft.AspNetCore.Authorization;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Web;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserApiInfrastructure
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий методы расширения для авторизации на основе разрешений
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XPermissionsExtension
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Добавление зависимостей для авторизации на основе разрешений
			/// </summary>
			/// <param name="services">Коллекция сервисов</param>
			/// <returns>Коллекция сервисов</returns>
			//---------------------------------------------------------------------------------------------------------
			public static IServiceCollection AddLotusPermissionsExtension(this IServiceCollection services)
			{
				services
					.AddSingleton<IAuthorizationPolicyProvider, PermissionsPolicyProvider>()
					.AddScoped<IAuthorizationHandler, PermissionsHandler>()
					.AddScoped<Func<CUserAuthorizeInfo?>>(sp => sp.GetService<CUserAuthorizeInfo>)
					.AddScoped<CUserAuthorizeInfo>(
						sp =>
						{
							var contextAccessor = sp.GetService<IHttpContextAccessor>();
							ClaimsIdentity? claimsIdentity = contextAccessor!.GetClaimsIdentity();

							if(claimsIdentity is not null)
							{
                                CUserAuthorizeInfo info = new CUserAuthorizeInfo();
                                info.SetThisFrom(claimsIdentity);
                                return info;
                            }

							return new CUserAuthorizeInfo();
						});

				return services;
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================