//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Сущности предметной области
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusPermission.cs
*		Класс для определения разрешения пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel.DataAnnotations;
using Microsoft.EntityFrameworkCore;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserEntities
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для определения разрешения пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CPermission : EntityDb<Int32>
		{
            #region ======================================= КОНСТАНТНЫЕ ДАННЫЕ ========================================
            /// <summary>
            /// Имя таблицы
            /// </summary>
            public const String TABLE_NAME = "Permission";
            #endregion

            #region ======================================= МЕТОДЫ ОПРЕДЕЛЕНИЯ МОДЕЛЕЙ ================================
            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Конфигурирование модели для типа <see cref="CPermission"/>
            /// </summary>
            /// <param name="modelBuilder">Интерфейс для построения моделей</param>
            //---------------------------------------------------------------------------------------------------------
            public static void ModelCreating(ModelBuilder modelBuilder)
			{
				// Определение для таблицы
				var model = modelBuilder.Entity<CPermission>();
				model.ToTable(TABLE_NAME, XDbConstants.SchemeName);

				model.HasMany(permission => permission.Roles)
					.WithMany(accesses => accesses.Permissions)
					.UsingEntity<CRolePermission>(
						role_perm => role_perm.HasOne<CRole>()
					.WithMany()
						.HasForeignKey(x => x.RoleId)
						.IsRequired()
						.OnDelete(DeleteBehavior.Restrict),
						role_perm => role_perm.HasOne<CPermission>()
					.WithMany()
						.HasForeignKey(x => x.PermissionId)
						.IsRequired()
						.OnDelete(DeleteBehavior.Restrict))
					.HasKey(nameof(CRolePermission.RoleId), nameof(CRolePermission.PermissionId));
            }
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Служебное наименование разрешения
			/// </summary>
			[MaxLength(20)]
			public String SystemName { get; set; } = null!;

			/// <summary>
			/// Наименование разрешения
			/// </summary>
			[MaxLength(40)]
			public String? DispalyName { get; set; }

			/// <summary>
			/// Список ролей куда входит данное разрешение
			/// </summary>
			public ICollection<CRole>? Roles { get; set; }
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================