//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Сущности предметной области
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusFieldActivity.cs
*		Класс для определения сферы деятельности пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel.DataAnnotations;
using Microsoft.EntityFrameworkCore;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserEntities
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для определения сферы деятельности пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CFieldActivity : EntityDb<Int32>
		{
			#region ======================================= МЕТОДЫ ОПРЕДЕЛЕНИЯ МОДЕЛЕЙ ================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конфигурирование модели для типа <see cref="CFieldActivity"/>
			/// </summary>
			/// <param name="modelBuilder">Интерфейс для построения моделей</param>
			//---------------------------------------------------------------------------------------------------------
			public static void ModelCreating(ModelBuilder modelBuilder)
			{
				// Определение для таблицы
				var model = modelBuilder.Entity<CFieldActivity>();
				model.ToTable("FieldActivity", XDbConstants.SchemeName);
			}
            #endregion

            #region ======================================= СВОЙСТВА ==================================================
            /// <summary>
            /// Наименование сферы деятельности
            /// </summary>
            [MaxLength(40)]
            public String Name { get; set; } = String.Empty;

            /// <summary>
            /// Краткое наименование сферы деятельности
            /// </summary>
            [MaxLength(20)]
			public String? ShortName { get; set; }

			/// <summary>
			/// Все пользователи
			/// </summary>
			public ICollection<CUser> Users { get; set; } = new HashSet<CUser>();
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================