//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Сущности предметной области
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusSession.cs
*		Класс для определения сессии пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel.DataAnnotations;
using System.ComponentModel.DataAnnotations.Schema;
using Microsoft.EntityFrameworkCore;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserEntities
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для определения сессии пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CSession : EntityDb<Guid>
		{
			#region ======================================= МЕТОДЫ ОПРЕДЕЛЕНИЯ МОДЕЛЕЙ ================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конфигурирование модели для типа <see cref="CSession"/>
			/// </summary>
			/// <param name="modelBuilder">Интерфейс для построения моделей</param>
			//---------------------------------------------------------------------------------------------------------
			public static void ModelCreating(ModelBuilder modelBuilder)
			{
				// Определение для таблицы
				var model = modelBuilder.Entity<CSession>();
				model.ToTable("Session", XDbConstants.SchemeName);

				model.HasOne(x => x.Device)
					.WithMany(x => x.Sessions);

				model.HasOne(x => x.User)
					.WithMany(x => x.Sessions);
			}
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Наименование браузера
			/// </summary>
			[MaxLength(20)]
			public String? Browser { get; set; }

			/// <summary>
			/// Время начало сессии
			/// </summary>
			[DataType(DataType.DateTime)]
			public DateTime BeginTime { get; set; }

			/// <summary>
			/// Время окончание сессии
			/// </summary>
			[DataType(DataType.DateTime)]
			public DateTime? EndTime { get; set; }

			/// <summary>
			/// Пользователь
			/// </summary>
			[ForeignKey(nameof(UserId))]
			public CUser? User { get; set; }

			/// <summary>
			/// Идентификатор пользователя 
			/// </summary>
			public Guid? UserId { get; set; }

			/// <summary>
			/// Устройство для входа
			/// </summary>
			[ForeignKey(nameof(DeviceId))]
			public CDevice? Device { get; set; }

			/// <summary>
			/// Идентификатор устройства 
			/// </summary>
			public Int32? DeviceId { get; set; }
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================