//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Сущности предметной области
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusMessage.cs
*		Класс для определения сообщения пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel.DataAnnotations.Schema;
using Microsoft.EntityFrameworkCore;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserEntities
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для определения сообщения пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CMessage : EntityDb<Guid>
		{
			#region ======================================= МЕТОДЫ ОПРЕДЕЛЕНИЯ МОДЕЛЕЙ ================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конфигурирование модели для типа <see cref="CMessage"/>
			/// </summary>
			/// <param name="modelBuilder">Интерфейс для построения моделей</param>
			//---------------------------------------------------------------------------------------------------------
			public static void ModelCreating(ModelBuilder modelBuilder)
			{
				// Определение для таблицы
				var model = modelBuilder.Entity<CMessage>();
				model.ToTable("Message", XDbConstants.SchemeName);
			}
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Текст сообщения
			/// </summary>
			public String Text { get; set; } = null!;

			/// <summary>
			/// Время отправки сообщения
			/// </summary>
			public DateTime Time { get; set; }

			/// <summary>
			/// Статус прочитания сообщения
			/// </summary>
			public Boolean IsRead { get; set; }

			//
			// АВТОР
			//
			/// <summary>
			/// Автор сообщения
			/// </summary>
			[ForeignKey(nameof(AuthorId))]
			public CUser? Author { get; set; }

			/// <summary>
			/// Идентификатор автора сообщения
			/// </summary>
			public Guid? AuthorId { get; set; }

			//
			// ПОЛУЧАТЕЛЬ
			//
			/// <summary>
			/// Получатель сообщения
			/// </summary>
			[ForeignKey(nameof(ReceiverId))]
			public CUser? Receiver { get; set; }

			/// <summary>
			/// Идентификатор получателя сообщения
			/// </summary>
			public Guid? ReceiverId { get; set; }
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================