//=====================================================================================================================
// Проект: Web API модуля авторизации пользователя
// Раздел: Методы расширения
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusIdentityExtension.cs
*		Статический класс реализующий методы расширения для работы подсистемой Identity.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Microsoft.AspNetCore.Identity;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserApiExtension
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий методы расширения для работы подсистемой Identity
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XIdentityExtension
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получение ошибок IdentityResult в виде строки
			/// </summary>
			/// <param name="identityResult">IdentityResult</param>
			/// <returns>Строка с ошибками</returns>
			//---------------------------------------------------------------------------------------------------------
			public static String GetErrorsText(this IdentityResult identityResult)
			{
				var errors = new List<string>();
				foreach (var error in identityResult.Errors)
				{
					errors.Add(error.Description);
				}

				return string.Join("\n", errors);
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================