//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Подсистема работы с пользователем
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserDto.cs
*		Класс информатор пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System.ComponentModel.DataAnnotations;
using System.ComponentModel.DataAnnotations.Schema;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserUser
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс информатор пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CUserDto : IdentifierDtoId<Guid>
        {
			#region ======================================= СВОЙСТВА ==================================================
			//
			// ИДЕНТИФИКАЦИЯ
			//
			/// <summary>
			/// Логин пользователя
			/// </summary>
			public String Login { get; set; } = null!;

			/// <summary>
			/// Почта пользователя
			/// </summary>
			public String? Email { get; set; }

			/// <summary>
			/// Статус потверждение почты
			/// </summary>
			public Boolean EmailConfirmed { get; set; }

			//
			// ПЕРСОНАЛЬНЫЕ ДАННЫЕ
			//
			/// <summary>
			/// Имя пользователя
			/// </summary>
			[MaxLength(30)]
			public String? Name { get; set; }

			/// <summary>
			/// Фамилия пользователя
			/// </summary>
			[MaxLength(30)]
			public String? Surname { get; set; }

			/// <summary>
			/// Отчество пользователя
			/// </summary>
			public String? Patronymic { get; set; }

			/// <summary>
			/// День рождение
			/// </summary>
			public DateOnly? Birthday { get; set; }

			//
			// РОЛЬ И РАЗРЕШЕНИЯ
			//
			/// <summary>
			/// Идентификатор роли
			/// </summary>
			public Int32 RoleId { get; set; }

			//
			// ДОЛЖНОСТЬ
			//
			/// <summary>
			/// Идентификатор должности
			/// </summary>
			public Int32? PostId { get; set; }

			//
			// ГРУППЫ
			//
			/// <summary>
			/// Группы пользователя
			/// </summary>
			public List<Int32>? GroupsIds { get; set; }

			//
			// CФЕРЫ ДЕЯТЕЛЬНОСТИ
			//
			/// <summary>
			/// Cферы деятельности пользователя
			/// </summary>
			public List<Int32>? FieldActivitiesIds { get; set; }

			//
			// АВАТАР
			//
			/// <summary>
			/// Идентификатор аватарв
			/// </summary>
			public Int32? AvatarId { get; set; }
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================