//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Подсистема работы с пользователем
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserCreateDto.cs
*		Класс для создания/регистрации нового пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel.DataAnnotations;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup AuthUserUser
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для создания/регистрации нового пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CUserCreateDto
		{
			/// <summary>
			/// Email
			/// </summary>
			[Required]
			public String Email { get; set; } = null!;

			/// <summary>
			/// Логин пользователя
			/// </summary>
			[Required]
			public String Login { get; set; } = null!;

			/// <summary>
			/// Пароль
			/// </summary>
			[Required]
			[DataType(DataType.Password)]
			public String Password { get; set; } = null!;

			/// <summary>
			/// Имя пользователя
			/// </summary>
			public String? Name { get; set; }

			/// <summary>
			/// Фамилия пользователя
			/// </summary>
			public String? Surname { get; set; }

			/// <summary>
			/// Отчество пользователя
			/// </summary>
			public String? Patronymic { get; set; }
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================