//=====================================================================================================================
// Проект: Модуль авторизации пользователя
// Раздел: Подсистема интерфейсов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserInfoInterface.cs
*		Интерфейс для определения данных пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus.Auth
{
	namespace User
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup AuthUserInterfaces Подсистема интерфейсов
         * \ingroup AuthUser
         * \brief Подсистема интерфейсов модуля.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для определения данных пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface IUserInfo : ILotusIdentifierId<Guid>
		{
			#region ======================================= СВОЙСТВА ==================================================
			//
			// ИДЕНТИФИКАЦИЯ
			//
			/// <summary>
			/// Логин пользователя
			/// </summary>
			public String Login { get; set; }

			/// <summary>
			/// Почта пользователя
			/// </summary>
			public String? Email { get; set; }

			/// <summary>
			/// Статус потверждение почты
			/// </summary>
			public Boolean EmailConfirmed { get; set; }

			//
			// ПЕРСОНАЛЬНЫЕ ДАННЫЕ
			//
			/// <summary>
			/// Имя пользователя
			/// </summary>
			public String? Name { get; set; }

			/// <summary>
			/// Фамилия пользователя
			/// </summary>
			public String? Surname { get; set; }

			/// <summary>
			/// Отчество пользователя
			/// </summary>
			public String? Patronymic { get; set; }

			/// <summary>
			/// День рождение
			/// </summary>
			public DateOnly? Birthday { get; set; }

			//
			// РОЛЬ И РАЗРЕШЕНИЯ
			//
			/// <summary>
			/// Служебное наименование роли
			/// </summary>
			public String RoleSystemName { get; set; }

			/// <summary>
			/// Список системных имен разрешений в виде текста
			/// </summary>
			public String PermissionsSystemNamesAsText { get; set; }


			//
			// ДОЛЖНОСТЬ
			//
			/// <summary>
			/// Краткое наименование должности
			/// </summary>
			public String PostShortName { get; set; }

			//
			// ГРУППЫ
			//
			/// <summary>
			/// Список имен групп пользователя в виде текста
			/// </summary>
			public String GroupNamesAsText { get; set; }

			//
			// CФЕРЫ ДЕЯТЕЛЬНОСТИ
			//
			/// <summary>
			/// Список имен сфер деятельности пользователя в виде текста
			/// </summary>
			public String FieldActivityNamesAsText { get; set; }
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================