//=====================================================================================================================
// Проект: Общий модуль платформы Web
// Раздел: Подсистема конфигурации и инициализации
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusWebModuleInitializer.cs
*		Инициализация общего модуля платформы Web.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Web
    {
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup WebCommonConfiguration Подсистема конфигурации и инициализации
         * \ingroup WebCommon
         * \brief Подсистема конфигурации и инициализации.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Инициализация общего модуля платформы Web
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XModuleInitializer
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Настройка сервисов общего модуля платформы Web
			/// </summary>
			/// <param name="services">Коллекция сервисов</param>
			/// <returns>Коллекция сервисов</returns>
			//---------------------------------------------------------------------------------------------------------
			public static IServiceCollection AddLotusCommonServices(this IServiceCollection services)
			{
                services.AddScoped<ApiExceptionFilterAttribute>();

                return services;
			}
        }
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================